本プロファイルは、JP_FamilyMemberHistoryリソースの記録・更新・検索を行う上で、準拠するべき必須となる要素や、サポートすべき拡張、用語、検索パラメータを定義する。

## スコープ
- JP_FamilyMemberHistoryは、FHIRワークフロー仕様のイベントリソースの１つである。
- 本プロファイルは、対象者に関連する特定の個人の重要な健康状態を記録する。この情報は、さまざまなレベルの正確さで知ることができる。正確な状態（喘息）がわかっている場合もあれば、あまり正確でない場合（ある種のがん）もある。同様に、人物を特定できる場合もあれば（e.g. 私の叔母（母方の長女）である幸子）、その人物が叔父であることだけがわかっている場合もある。
- 本プロファイルは、特定の家族の「初歩的な」家族史を把握するために使用される単純な構造を表している。しかし、遺伝子解析やその他の分析に有用な、より厳密な歴史を把握するための基礎とすることもできる。 - 例として、[Genetic Pedigree](https://hl7.org/fhir/r4/familymemberhistory-genetic.html)プロファイルを参照すること。
- JP_FamilyMemberHistoryインスタンスへの参照をListリソースインスタンスに結合することで、個人の家族歴全体を表現することができる。

## 想定シナリオ

本プロファイルは、以下のようなユースケースを想定する。

- JP_FamilyMemberHistoryリソースの記録・更新・検索

## プロファイル定義
